n8n-attendance/backend/performance/load-tests/api-load-test.yml
config:
  target: 'http://localhost:3001'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    # Ramp-up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up"
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    # Peak load phase
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
    # Cool-down phase
    - duration: 60
      arrivalRate: 100
      rampTo: 5
      name: "Cool-down"
  
  variables:
    testUserId: "test-user-{{ $randomInt(1, 1000) }}"
    deviceId: "device-{{ $randomInt(1, 100) }}"
  
  processor: "./processors/auth-processor.js"
  
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Authentication Flow"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test{{ $randomInt(1, 100) }}@example.com"
            password: "TestPassword123!"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/auth/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"
  
  - name: "Attendance Operations"
    weight: 40
    flow:
      - function: "generateAuthToken"
      - post:
          url: "/api/attendance/checkin"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            deviceId: "{{ deviceId }}"
            location:
              latitude: 40.7128
              longitude: -74.0060
      - get:
          url: "/api/attendance/status"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - post:
          url: "/api/attendance/checkout"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            deviceId: "{{ deviceId }}"
  
  - name: "User Management"
    weight: 20
    flow:
      - function: "generateAdminToken"
      - get:
          url: "/api/users"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          qs:
            page: "{{ $randomInt(1, 5) }}"
            limit: "10"
      - get:
          url: "/api/users/{{ $randomInt(1, 100) }}"
          headers:
            Authorization: "Bearer {{ adminToken }}"
  
  - name: "Reports Generation"
    weight: 10
    flow:
      - function: "generateAdminToken"
      - post:
          url: "/api/reports/attendance"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          json:
            startDate: "2024-01-01"
            endDate: "2024-01-31"
            format: "json"